ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DB28def.inc
; PORT_PINCTRLSET masks
.equ PORT_PINCTRLSET_gm = 0xFF           ; Pin control set mask group mask
.equ PORT_PINCTRLSET_gp = 0              ; Pin control set mask group position
.equ PORT_PINCTRLSET_0_bm = (1<<0)       ; Pin control set mask bit 0 mask
.equ PORT_PINCTRLSET_0_bp = 0            ; Pin control set mask bit 0 position
.equ PORT_PINCTRLSET_1_bm = (1<<1)       ; Pin control set mask bit 1 mask
.equ PORT_PINCTRLSET_1_bp = 1            ; Pin control set mask bit 1 position
.equ PORT_PINCTRLSET_2_bm = (1<<2)       ; Pin control set mask bit 2 mask
.equ PORT_PINCTRLSET_2_bp = 2            ; Pin control set mask bit 2 position
.equ PORT_PINCTRLSET_3_bm = (1<<3)       ; Pin control set mask bit 3 mask
.equ PORT_PINCTRLSET_3_bp = 3            ; Pin control set mask bit 3 position
.equ PORT_PINCTRLSET_4_bm = (1<<4)       ; Pin control set mask bit 4 mask
.equ PORT_PINCTRLSET_4_bp = 4            ; Pin control set mask bit 4 position
.equ PORT_PINCTRLSET_5_bm = (1<<5)       ; Pin control set mask bit 5 mask
.equ PORT_PINCTRLSET_5_bp = 5            ; Pin control set mask bit 5 position
.equ PORT_PINCTRLSET_6_bm = (1<<6)       ; Pin control set mask bit 6 mask
.equ PORT_PINCTRLSET_6_bp = 6            ; Pin control set mask bit 6 position
.equ PORT_PINCTRLSET_7_bm = (1<<7)       ; Pin control set mask bit 7 mask
.equ PORT_PINCTRLSET_7_bp = 7            ; Pin control set mask bit 7 position

; PORT_PINCTRLCLR masks
.equ PORT_PINCTRLCLR_gm = 0xFF           ; Pin control clear mask group mask
.equ PORT_PINCTRLCLR_gp = 0              ; Pin control clear mask group position
.equ PORT_PINCTRLCLR_0_bm = (1<<0)       ; Pin control clear mask bit 0 mask
.equ PORT_PINCTRLCLR_0_bp = 0            ; Pin control clear mask bit 0 position
.equ PORT_PINCTRLCLR_1_bm = (1<<1)       ; Pin control clear mask bit 1 mask
.equ PORT_PINCTRLCLR_1_bp = 1            ; Pin control clear mask bit 1 position
.equ PORT_PINCTRLCLR_2_bm = (1<<2)       ; Pin control clear mask bit 2 mask
.equ PORT_PINCTRLCLR_2_bp = 2            ; Pin control clear mask bit 2 position
.equ PORT_PINCTRLCLR_3_bm = (1<<3)       ; Pin control clear mask bit 3 mask
.equ PORT_PINCTRLCLR_3_bp = 3            ; Pin control clear mask bit 3 position
.equ PORT_PINCTRLCLR_4_bm = (1<<4)       ; Pin control clear mask bit 4 mask
.equ PORT_PINCTRLCLR_4_bp = 4            ; Pin control clear mask bit 4 position
.equ PORT_PINCTRLCLR_5_bm = (1<<5)       ; Pin control clear mask bit 5 mask
.equ PORT_PINCTRLCLR_5_bp = 5            ; Pin control clear mask bit 5 position
.equ PORT_PINCTRLCLR_6_bm = (1<<6)       ; Pin control clear mask bit 6 mask
.equ PORT_PINCTRLCLR_6_bp = 6            ; Pin control clear mask bit 6 position
.equ PORT_PINCTRLCLR_7_bm = (1<<7)       ; Pin control clear mask bit 7 mask
.equ PORT_PINCTRLCLR_7_bp = 7            ; Pin control clear mask bit 7 position

; PORT_PIN0CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN1CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN2CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN3CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN4CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN5CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN6CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN7CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; Input/Sense Configuration select
.equ PORT_ISC_INTDISABLE_gc = (0x00<<0)  ; Interrupt disabled but input buffer enabled
.equ PORT_ISC_BOTHEDGES_gc = (0x01<<0)   ; Sense Both Edges
.equ PORT_ISC_RISING_gc = (0x02<<0)      ; Sense Rising Edge
.equ PORT_ISC_FALLING_gc = (0x03<<0)     ; Sense Falling Edge
.equ PORT_ISC_INPUT_DISABLE_gc = (0x04<<0) ; Digital Input Buffer disabled
.equ PORT_ISC_LEVEL_gc = (0x05<<0)       ; Sense low Level


;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************

; PORTMUX_EVSYSROUTEA masks
.equ PORTMUX_EVOUTA_bm = 0x01            ; Event Output A bit mask
.equ PORTMUX_EVOUTA_bp = 0               ; Event Output A bit position
.equ PORTMUX_EVOUTC_bm = 0x04            ; Event Output C bit mask
.equ PORTMUX_EVOUTC_bp = 2               ; Event Output C bit position
.equ PORTMUX_EVOUTD_bm = 0x08            ; Event Output D bit mask
.equ PORTMUX_EVOUTD_bp = 3               ; Event Output D bit position
.equ PORTMUX_EVOUTF_bm = 0x20            ; Event Output F bit mask
.equ PORTMUX_EVOUTF_bp = 5               ; Event Output F bit position

; PORTMUX_CCLROUTEA masks
.equ PORTMUX_LUT0_bm = 0x01              ; CCL Look-Up Table 0 Signals bit mask
.equ PORTMUX_LUT0_bp = 0                 ; CCL Look-Up Table 0 Signals bit position
.equ PORTMUX_LUT1_bm = 0x02              ; CCL Look-Up Table 1 Signals bit mask
.equ PORTMUX_LUT1_bp = 1                 ; CCL Look-Up Table 1 Signals bit position
.equ PORTMUX_LUT2_bm = 0x04              ; CCL Look-Up Table 2 Signals bit mask
.equ PORTMUX_LUT2_bp = 2                 ; CCL Look-Up Table 2 Signals bit position
.equ PORTMUX_LUT3_bm = 0x08              ; CCL Look-Up Table 3 Signals bit mask
.equ PORTMUX_LUT3_bp = 3                 ; CCL Look-Up Table 3 Signals bit position

; PORTMUX_USARTROUTEA masks
.equ PORTMUX_USART0_gm = 0x03            ; USART0 Signals group mask
.equ PORTMUX_USART0_gp = 0               ; USART0 Signals group position
.equ PORTMUX_USART0_0_bm = (1<<0)        ; USART0 Signals bit 0 mask
.equ PORTMUX_USART0_0_bp = 0             ; USART0 Signals bit 0 position
.equ PORTMUX_USART0_1_bm = (1<<1)        ; USART0 Signals bit 1 mask
.equ PORTMUX_USART0_1_bp = 1             ; USART0 Signals bit 1 position
.equ PORTMUX_USART1_gm = 0x0C            ; USART1 Signals group mask
.equ PORTMUX_USART1_gp = 2               ; USART1 Signals group position
.equ PORTMUX_USART1_0_bm = (1<<2)        ; USART1 Signals bit 0 mask
.equ PORTMUX_USART1_0_bp = 2             ; USART1 Signals bit 0 position
.equ PORTMUX_USART1_1_bm = (1<<3)        ; USART1 Signals bit 1 mask
.equ PORTMUX_USART1_1_bp = 3             ; USART1 Signals bit 1 position
.equ PORTMUX_USART2_gm = 0x30            ; USART2 Signals group mask
.equ PORTMUX_USART2_gp = 4               ; USART2 Signals group position
.equ PORTMUX_USART2_0_bm = (1<<4)        ; USART2 Signals bit 0 mask
.equ PORTMUX_USART2_0_bp = 4             ; USART2 Signals bit 0 position
.equ PORTMUX_USART2_1_bm = (1<<5)        ; USART2 Signals bit 1 mask
.equ PORTMUX_USART2_1_bp = 5             ; USART2 Signals bit 1 position

; PORTMUX_SPIROUTEA masks
.equ PORTMUX_SPI0_gm = 0x03              ; SPI0 Signals group mask
.equ PORTMUX_SPI0_gp = 0                 ; SPI0 Signals group position
.equ PORTMUX_SPI0_0_bm = (1<<0)          ; SPI0 Signals bit 0 mask
.equ PORTMUX_SPI0_0_bp = 0               ; SPI0 Signals bit 0 position
.equ PORTMUX_SPI0_1_bm = (1<<1)          ; SPI0 Signals bit 1 mask
.equ PORTMUX_SPI0_1_bp = 1               ; SPI0 Signals bit 1 position
.equ PORTMUX_SPI1_gm = 0x0C              ; SPI1 Signals group mask
.equ PORTMUX_SPI1_gp = 2                 ; SPI1 Signals group position
.equ PORTMUX_SPI1_0_bm = (1<<2)          ; SPI1 Signals bit 0 mask
.equ PORTMUX_SPI1_0_bp = 2               ; SPI1 Signals bit 0 position
.equ PORTMUX_SPI1_1_bm = (1<<3)          ; SPI1 Signals bit 1 mask
.equ PORTMUX_SPI1_1_bp = 3               ; SPI1 Signals bit 1 position

; PORTMUX_TWIROUTEA masks
.equ PORTMUX_TWI0_gm = 0x03              ; TWI0 Signals group mask
.equ PORTMUX_TWI0_gp = 0                 ; TWI0 Signals group position
.equ PORTMUX_TWI0_0_bm = (1<<0)          ; TWI0 Signals bit 0 mask
.equ PORTMUX_TWI0_0_bp = 0               ; TWI0 Signals bit 0 position
.equ PORTMUX_TWI0_1_bm = (1<<1)          ; TWI0 Signals bit 1 mask
.equ PORTMUX_TWI0_1_bp = 1               ; TWI0 Signals bit 1 position

; PORTMUX_TCAROUTEA masks
.equ PORTMUX_TCA0_gm = 0x07              ; TCA0 Signals group mask
.equ PORTMUX_TCA0_gp = 0                 ; TCA0 Signals group position
.equ PORTMUX_TCA0_0_bm = (1<<0)          ; TCA0 Signals bit 0 mask
.equ PORTMUX_TCA0_0_bp = 0               ; TCA0 Signals bit 0 position
.equ PORTMUX_TCA0_1_bm = (1<<1)          ; TCA0 Signals bit 1 mask
.equ PORTMUX_TCA0_1_bp = 1               ; TCA0 Signals bit 1 position
.equ PORTMUX_TCA0_2_bm = (1<<2)          ; TCA0 Signals bit 2 mask
.equ PORTMUX_TCA0_2_bp = 2               ; TCA0 Signals bit 2 position

; PORTMUX_TCBROUTEA masks
.equ PORTMUX_TCB0_bm = 0x01              ; TCB0 Output bit mask
.equ PORTMUX_TCB0_bp = 0                 ; TCB0 Output bit position
.equ PORTMUX_TCB1_bm = 0x02              ; TCB1 Output bit mask
.equ PORTMUX_TCB1_bp = 1                 ; TCB1 Output bit position
.equ PORTMUX_TCB2_bm = 0x04              ; TCB2 Output bit mask
.equ PORTMUX_TCB2_bp = 2                 ; TCB2 Output bit position

; PORTMUX_TCDROUTEA masks
.equ PORTMUX_TCD0_gm = 0x07              ; TCD0 Signals group mask
.equ PORTMUX_TCD0_gp = 0                 ; TCD0 Signals group position
.equ PORTMUX_TCD0_0_bm = (1<<0)          ; TCD0 Signals bit 0 mask
.equ PORTMUX_TCD0_0_bp = 0               ; TCD0 Signals bit 0 position
.equ PORTMUX_TCD0_1_bm = (1<<1)          ; TCD0 Signals bit 1 mask
.equ PORTMUX_TCD0_1_bp = 1               ; TCD0 Signals bit 1 position
.equ PORTMUX_TCD0_2_bm = (1<<2)          ; TCD0 Signals bit 2 mask
.equ PORTMUX_TCD0_2_bp = 2               ; TCD0 Signals bit 2 position

